use V_MyBASE
--1
go
create view [Заказчик_инфо]
as select Наименование_фирмы[Наименование], 
		  Адрес[Адрес], 
		  Расчетный_счет[Расчетный счет]
from Заказчики

go
select*from [Заказчик_инфо]

go
drop view [Заказчик_инфо]

--2
go
create view [Количество_заказов_по_заказчикам]
as select Заказчик[Заказчик],
		  COUNT(Номер_заказа)[Количество заказов]
from Заказы
group by Заказчик
go
select*from [Количество_заказов_по_заказчикам]

go
drop view [Количество_заказов_по_заказчикам]

--3
go
create view [Дорогие_товары]
as select Наименование[Наименование товара],
		  Цена[Цена],
		  Количество[Количество на складе]
from Товары
where Цена > 1500

go 
select*from [Дорогие_товары]

go 
drop view [Дорогие_товары]

--4
go
create view [Дорогие_товары_с_проверкой]
as select Наименование[Наименование товара],
		  Цена[Цена],
		  Количество[Количество на складе]
from Товары
where Цена > 1500 with check option

go
select*from [Дорогие_товары_с_проверкой]

go
drop view [Дорогие_товары_с_проверкой]

--5
go
create view [Последние_заказы]
as select TOP 10 Номер_заказа[Номер заказа],
	      Наименование_товара[Наименование товара],
		  Цена_продажи[Цена продажи],
		  Дата_поставки[Дата поставки],
		  Заказчик[Заказчик]
from Заказы order by Дата_поставки desc

go
select*from [Последние_заказы]

go
drop view [Последние_заказы]

--6
go
alter view [Количество_заказов_по_заказчикам] with SCHEMABINDING
as select zk.Заказчик[Заказчик],
		  COUNT(zk.Номер_заказа)[Количество заказов]
from dbo.Заказы zk
group by zk.Заказчик

go
select*from [Количество_заказов_по_заказчикам]

go
drop view [Количество_заказов_по_заказчикам]