use V_MyBASE;

--1
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
ROUND(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'Рога и Копыта'
group by rollup (Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы)

--2
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
ROUND(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'Рога и Копыта'
group by cube (Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы)

--3
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'Рога и Копыта'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы
union
--union all
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'ООО "Весна"'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы

--4
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'Рога и Копыта'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы
intersect
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'ООО "Весна"'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы

--5
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'Рога и Копыта'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы
except
select Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы,
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Заказчики
inner join Заказы on Заказчики.Наименование_фирмы = Заказы.Заказчик
inner join Товары on Товары.Наименование = Заказы.Наименование_товара
where Заказчики.Наименование_фирмы like 'ООО "Весна"'
group by Заказы.Заказчик, Товары.Наименование, Заказчики.Наименование_фирмы