use V_MyBASE
--1
-- Анализ товаров по их наименованию 
select Товары.Наименование,
max (Товары.Цена)[Максимальная цена],
min (Товары.Цена)[Минимальная цена],
avg (Товары.Цена)[Средняя цена],
sum (Товары.Количество)[Суммарное количество],
count (Товары.Количество)[Общее кол-во товаров]
from Товары
group by Товары.Наименование

--2
-- Группировка заказов по диапазонам цен продажи 
select*
from(select Case when Заказы.Цена_продажи between 0 and 1000 then '0-1000'
				 when Заказы.Цена_продажи between 1001 and 2000 then '1001-2000'
				 when Заказы.Цена_продажи between 2001 and 3000 then '2001-3000'
				 else '3000+'
				 end[Ценовые диапазоны], COUNT(*)[Количество]
from Заказы group by Case when Заказы.Цена_продажи between 0 and 1000 then '0-1000'
							when Заказы.Цена_продажи between 1001 and 2000 then '1001-2000'
							when Заказы.Цена_продажи between 2001 and 3000 then '2001-3000'
							else '3000+'
							end) as T
							order by case[Ценовые диапазоны]
							when '0-1000' then 3
							when '1001-2000' then 2
							when '2001-3000' then 1
							else 0
							end

--3
-- Анализ заказов по заказчикам
select Заказы.Заказчик[Заказчик], Товары.Наименование[Наименование товара], 
round(avg(cast(Заказы.Цена_продажи as float)),2) [Средняя цена продажи], 
avg(Заказы.Количество) [Среднее количество]
from Товары
	inner join Заказы on Товары.Наименование = Заказы.Наименование_товара
	inner join Заказчики on Заказчики.Наименование_фирмы = Заказы.Заказчик
group by
	Заказы.Заказчик, Товары.Наименование
order by [Средняя цена продажи] desc

--4
-- Заказы только по определенным товарам 
select Заказы.Заказчик[Заказчик], Товары.Наименование[Наименование товара],
round(avg(cast(Заказы.Цена_продажи as float)), 2)[Средняя цена продажи], 
avg(Заказы.Количество)[Среднее количество]
from Товары
	inner join Заказы on Товары.Наименование = Заказы.Наименование_товара
	inner join Заказчики on Заказчики.Наименование_фирмы = Заказы.Заказчик
where
	Товары.Наименование = 'Компьютер' or Товары.Наименование = 'Телефон'
group by
	Заказы.Заказчик, Товары.Наименование
order by [Средняя цена продажи] desc

--5
-- Анализ по конкретному заказчику 
select Заказы.Заказчик[Заказчик], Товары.Наименование[Наименование товара],
round(avg(cast(Заказы.Цена_продажи as float)), 2) as [Средняя цена продажи]
from Товары
inner join Заказы on Товары.Наименование = Заказы.Наименование_товара
inner join Заказчики on Заказчики.Наименование_фирмы = Заказы.Заказчик
where Заказы.Заказчик like 'Рога и Копыта'
group by Заказы.Заказчик, Товары.Наименование

--6
-- Количество заказов по товарам с определенным количеством 
select Заказы.Наименование_товара [Наименование товара], COUNT(*) [Количество заказов]
from Заказы
group by Заказы.Наименование_товара, Заказы.Количество
having Заказы.Количество = '2' or Заказы.Количество = '1'
order by [Количество заказов] desc, [Наименование товара]